// Подключаем необходимые пространства имен
using System.Configuration; // Для работы с конфигурациями приложения
using System.Data; // Для работы с данными, например, с базами данных
using System.Windows; // Для работы с элементами интерфейса Windows

namespace CourseProject // Определяем пространство имен для нашего проекта
{
    // Частичный класс App, который наследует функциональность от класса Application
    public partial class App : Application
    {
        // Здесь можно добавить дополнительные методы и свойства,
        // специфичные для данного приложения.
    }
}
